package com.jameshughes89.dougtheduck;

/**
 * Created by JamesHughes89 on 4/27/2017.
 * Translated by Negar Nazari 6/18/2017.
 *
 * This class just holds some FARSI Strings that will be printed
 * as debugging tips that Doug can suggest to the user.
 */

class DebugTipsFarsi {

    /**
     * Just a static array of doug's tips (of type String)
     */
    static String[] Tips = {

            // Slow down
            "لطفا به من بگو کدت قراراست چه کاری انجام بدهد. مطمئن باش که حداکثر استفاده از زمانت رو میکنی.",
            "خط به خط. شوخی نمی کنم انجامش بده. هیچ فرضیه ای در مورد کدت درست نکن.",
            "سرعتت رو کم کن! منم باید تعقیبت کنم.",
            "حداکثر استفاده از زمانت رو برای هر خط بکن. عجله نکن ، زمان داریم.",
            "یک تکه کاغذ بردار و هرچیزی که اتفاق می افته رو رسم کن.",
            "می تونی از یه دوست کمک بگیری که همراهت کد رو چک کنه؟",
            "ممکنه تا الان این کار رو کرده باشی اما اگر نکردی باید کد رو دی باگ کنی.",
            "برای هر خط یه توضیح (کامنت) بنویس و بعد آروم آروم شروع کن به حذف کردن کامنتها تا وقتی که مشکل رو پیدا کنی.",
            "بعضی از چیزهایی که باعث برهم خوردن تمرکزت میشه ببند.",
            "فیسبوک رو ببند، موبایلت رو کنار بذار، ردییت (وب سایت خبری) رو خاموش کن",

            // Broad ideas of things to change/do
            "چندتا کامنت دیگه اضافه کن. ممکنه که غافلگیر بشی.",
            "فکر میکنی تغییر اسامی متغیرها میتونه تو این شرایط کمک کنه؟",
            "ممکنه که تقسیم کد به کدهای کوچک تر که کار کردن باهاشون راحتتره ایده ای خوبی باشه.",
            "از پرینت استیمنت های بیشتری استفاده کنید.",
            "از پرینت استتیمنت می تونید استفاده کنید برای جدا کردن کد و فهمیدن اینکه مشکل کار کجاست.",
            "تعدادی پرینت در برخی استیمنت های اگر بگذارید، آیا ما آنها را به درستی ابلاغ کردیم؟",
            "سعی کنید برخی از این متغیرها را در حال اجرای کد چاپ کنید.",
            "مقادیر متغیرها رو  در طول انجام عملیات  پیگیری کن.",
            "برخی اوقات شماره خط اشتباه خاموش هست. اطراف آن را بررسی کنید.",
            "آیا لوپ به اندازه ای که شما فکر می کردید اجرا می شود؟",
            "آیا مشکل مربوط به یک مورد خاص هست یا عمومی هست؟",
            "آیا مشکل به دلیل چیزهایی است که شما استفاده می کنید و نه به دلیل روشی که به کار می برید.",
            "از تعدادی شرایط رندوم استفاده کنید و ببینید چه تغییری حاصل می شود.",
            "شاید یک پوینتر رو به جای کپی کردن اطلاعات عوض کردید.",

            // Oddly specific things to change/do
            "آیا لوپ با یک غیر صفر شروع میشه؟چرا ؟ مطمئن هستید؟",
            "آیا مطمئن هستید که لوپ باید به طول ۲ برسه؟ به نظر غیر طبیعی میاد.",
            "آیا == هست وقتی که باید == باشد؟",
            "آیا لوپ درونی وابسته به متغیرهای لوپ خارجی هست؟ اینها بعضی مواقع می توانند مشکل ساز یاشند.",
            "آیا این متغیرها رو مقادیر اولیه درستی دادید؟",
            "آیا متغیرها رو به روز کردید؟ دوباره چک کنید.",
            "بعضی مواقع بهتر است که متغیرها رو پاک کنید قبل از اینکه دوباره از اونها استفاده کنید.",
            "آیا کانتر افزایش صعودی درستی دارد؟",
            "شاید تعداد دفعاتی که لوپ اجرا می شود رو می شمارد ، آیا این چیزی است که شما می خواهید؟",

            // Motivational
            "این خیلی خسته کننده است ولی من مطمئن هستم به چیزی که می خواهیم می رسیم.",
            "تسلیم نشوید ، اما شاید یک استراحت کوتاه بکنید. هیچ وقت قدرت یک استراحت رو کم نگیرید.",
            "احتمال داره که غافلگیر بشید با تغییر طرز فکرتون در ده دقیقه.",
            "شما این رو حل خواهید کرد ولی همزمان  به کارهای دیگه هم برسید. یه تنوع می تونه خوب باشه.",
    };

}
